PRIORITIES = {
    "구매자": {
        "환불 받기": 80,
        "판매자에 대한 부정적인 리뷰 유지하기": 5,
        "판매자가 나에 대한 부정적인 리뷰 철회하기": 10, 
        "상대로부터 공식적인 사과받기": 5
        },
    "판매자": {
        "환불 방어": 50, 
        "구매자에 대한 부정적인 리뷰 유지하기": 10,
        "구매자가 나에 대한 부정적인 리뷰 철회하기": 30, 
        "상대로부터 공식적인 사과받기": 10
        }
}

SCENARIOS = {
    "구매자": (
        "당신은 아픈 조카가 있습니다. 조카는 손흥민의 엄청난 팬입니다. "
        "당신은 조카를 위해 손흥민 유니폼을 구매하였습니다. "
        "하지만 막상 유니폼을 받아보니 손흥민 유니폼이 아닌 토트넘 클럽 유니폼이 도착했습니다. "
        "당신은 손흥민 유니폼인 줄 알고 구매했지만 원하는 상품을 받지 못했기에 환불을 요청했습니다. "
        "하지만 판매자는 손흥민 유니폼이 아닌 토트넘 클럽 유니폼을 판매했고, "
        "특정 선수의 유니폼이 아니라는 이유로 환불 요청을 받아줄 수 없다고 했습니다. "
        "이에 따라 당신은 판매자에 대한 욕설이 섞인 부정적인 리뷰를 사이트에 남겨두었고, "
        "판매자 역시 당신은 터무니 없는 요구를 하는 진상이라는 부정적인 리뷰를 남겼습니다."
    ),
    "판매자": (
        "당신은 온라인 스포츠웨어 판매 사이트의 운영자입니다. "
        "구매자는 손흥민 유니폼을 구매했는데 토트넘 클럽 유니폼이 도착했다며 환불을 요청했습니다. "
        "하지만 당신은 손흥민 유니폼이 아닌 토트넘 클럽 유니폼을 판매했고, "
        "특정 선수의 유니폼이 아니라는 이유로 환불 요청을 받아줄 수 없다고 했습니다. "
        "이에 따라 구매자가 당신은 사기꾼이라는 욕설이 섞인 부정적인 리뷰를 사이트에 남겼고, "
        "당신 역시 구매자는 터무니 없는 요구를 하는 진상이라는 부정적인 리뷰를 남겼습니다."
    )
}
